# Problem set 2

## Question 1
Consider the following Python module:
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2
After importing the module into the interpreter, you execute:
>>> b()  
>>> b()  
>>> b()  
>>> a  
?  
What value is displayed when the last expression (a) is evaluated? Explain your  
answer by indicating what happens in every executed statement.

## Answer

In [45]:
a = 0
def b():
    global a
    a = c(a)
def c(a):
    return a + 2


print(c(3))
print(b())
a

5
None

2

Here a is outside the shell so it is a global scope. When we take it inside the shell, a = c(a) which will eventually give me value of a as 2 {0(value of a) + 2 = 2} under the function b.  
However if i run b() I will get none as b do not have any return statement.  
If i evaluate (a) I'll get the new value of a i.e. c(a) = 0+2 = 2.

## Question 2

Function fileLength(), given to you, takes the name of a file as input and returns  
the length of the file:  
fileLength('midterm.py')  
284  
fileLength('idterm.py')  
Traceback (most recent call last):  
File "<pyshell#34>", line 1, in <module>  
 fileLength('idterm.py')  
File "/Users/me/midterm.py", line 3, in fileLength  
 infile = open(filename)  
FileNotFoundError: [Errno 2] No such file or directory:  
'idterm.py'  
As shown above, if the file cannot be found by the interpreter or if it cannot be read  
as a text file, an exception will be raised. Modify function fileLength() so that a  
friendly message is printed instead:  
fileLength('midterm.py')  
358  
fileLength('idterm.py')  
File idterm.py not found.

## Answer

In [4]:
def fileLength(filename):
    try:                                                   #using Try except.
        infile = open(filename)
        content = infile.read()
        infile.close()
        wordList = content.split()
        return len(wordList)
    except:
        return('File',filename,'not found')

print(fileLength('midterm.txt'))
print(fileLength('midtermm.txt'))

9
('File', 'midtermm.txt', 'not found')

## Question 3

Write a class named Marsupial that can be used as shown below:  
m = Marsupial()  
m.put_in_pouch('doll')  
m.put_in_pouch('firetruck')  
m.put_in_pouch('kitten')  
m.pouch_contents()  
['doll', 'firetruck', 'kitten']  
Now write a class named Kangaroo as a subclass of Marsupial that inherits all the  
attributes of Marsupial and also:  
a. extends the Marsupial __init__ constructor to take, as input, the  
coordinates x and y of the Kangaroo object,  
b. supports method jump that takes number values dx and dy as input and  
moves the kangaroo by dx units along the x-axis and by dy units along the yaxis, and  
c. overloads the __str__ operator so it behaves as shown below.  
k = Kangaroo(0,0)  
print(k)  
I am a Kangaroo located at coordinates (0,0)  
k.put_in_pouch('doll')  
k.put_in_pouch('firetruck')  
k.put_in_pouch('kitten')  
k.pouch_contents()  
['doll', 'firetruck', 'kitten']  
k.jump(1,0)  
k.jump(1,0)  
k.jump(1,0)  
print(k)  
|I am a Kangaroo located at coordinates (3,0)

## Answer

In [38]:
class Marsupial():
    def __init__(self, lst=[]):
        self.lst = lst
        
    def put_in_touch(self, animal):
        self.lst.append(animal)
        
    def pouch_contents(self):
        return self.lst

class Kangaroo(Marsupial):
        def __init__(self, xcord, ycord):
            Marsupial.__init__(self)
            self.xcord = xcord
            self.ycord = ycord
            
        def __repr__(self):
            return ('I\'m a kanngaroo and located at coordinates ({}, {})'.format(self.xcord, self.ycord))
        
        def jump(self, dx, dy):
            self.xcord += dx
            self.ycord += dy

            
a = Marsupial()
a.put_in_touch('doll')
a.put_in_touch('firetruck')
a.put_in_touch('kitten')
print(a.pouch_contents())

k = Kangaroo(0, 0)
print(k)
k.jump(1, 0)
k.jump(1, 0)
k.jump(1, 0)
print(k)

['doll', 'firetruck', 'kitten']
I'm a kanngaroo and located at coordinates (0, 0)
I'm a kanngaroo and located at coordinates (3, 0)

## Question 4

Write function collatz() that takes a positive integer x as input and prints the
Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying
this rule to the previous number x in the sequence:
x = {
𝑥/2 𝑖𝑓 𝑥 𝑖𝑠 𝑒𝑣𝑒𝑛
3𝑥 + 1 𝑖𝑓 𝑥 𝑖𝑠 𝑜𝑑𝑑
Your function should stop when the sequence gets to number 1. Your
implementation must be recursive, without any loops.

### Answer

In [2]:
def collatz(n): 
       
    while n != 1:                   #consultant to a friend as I was getting an infinite answer for n = 1
        print(n, end = ' ')              
        
        if n % 2 == 0:
            n = n//2
        else:
            n = 3*n+1
    print(n)
collatz(10)

10 5 16 8 4 2 1

## Question 5

Write a recursive method binary() that takes a non-negative
integer n and prints the binary representation of integer n.

In [22]:
def binary(n):
 
    if (n > 1):
        binary(n >> 1)
    print(n & 1, end="")

binary(0)

0

In [23]:
binary(1)

1

In [24]:
binary(3)

11

In [25]:
binary(9)

1001

## Question 8

Write SQL queries on the below database table that return:  
a) All the temperature data.  
b) All the cities, but without repetition.  
c) All the records for India.  
d) All the Fall records.  
e) The city, country, and season for which the average rainfall is between 200  
and 400 millimeters.  
f) The city and country for which the average Fall temperature is above 20  
degrees, in increasing temperature order.  
g) The total annual rainfall for Cairo.  
h) The total rainfall for each season

In [29]:
%load_ext sql  

%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [30]:
%%sql
CREATE TABLE data_base(City var(20),Country var(20),Season var(20),Temperature var(20),Rainfall var(20));
INSERT INTO data_base VALUES('Mumbai','India','Winter','24.8','5.9');  
INSERT INTO data_base VALUES('Mumbai','India','Spring','28.4','16.2');
INSERT INTO data_base VALUES('Mumbai','India','Summer','27.9','1549.4');
INSERT INTO data_base VALUES('Mumbai','India','Fall','27.6','346.0');
INSERT INTO data_base VALUES('London','United Kingdom','Winter','4.2','207.7');
INSERT INTO data_base VALUES('London','United Kingdom','Spring','8.3','169.6');
INSERT INTO data_base VALUES('London','United Kingdom','Summer','15.7','157.0');
INSERT INTO data_base VALUES('London','United Kingdom','Fall','10.4','218.5');
INSERT INTO data_base VALUES('Cairo','Egypt','Winter','13.6','16.5');
INSERT INTO data_base VALUES('Cairo','Egypt','Spring','20.7','6.5');
INSERT INTO data_base VALUES('Cairo','Egypt','Summer','27.7','0.1');
INSERT INTO data_base VALUES('Cairo','Egypt','Fall','22.2','4.5');

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [32]:
%sql SELECT * FROM data_base;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [33]:
%sql SELECT City, Country, Season, Temperature from data_base;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8),
 ('Mumbai', 'India', 'Spring', 28.4),
 ('Mumbai', 'India', 'Summer', 27.9),
 ('Mumbai', 'India', 'Fall', 27.6),
 ('London', 'United Kingdom', 'Winter', 4.2),
 ('London', 'United Kingdom', 'Spring', 8.3),
 ('London', 'United Kingdom', 'Summer', 15.7),
 ('London', 'United Kingdom', 'Fall', 10.4),
 ('Cairo', 'Egypt', 'Winter', 13.6),
 ('Cairo', 'Egypt', 'Spring', 20.7),
 ('Cairo', 'Egypt', 'Summer', 27.7),
 ('Cairo', 'Egypt', 'Fall', 22.2)]

In [34]:
%sql SELECT City, Country, Season, Temperature from data_base;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8),
 ('Mumbai', 'India', 'Spring', 28.4),
 ('Mumbai', 'India', 'Summer', 27.9),
 ('Mumbai', 'India', 'Fall', 27.6),
 ('London', 'United Kingdom', 'Winter', 4.2),
 ('London', 'United Kingdom', 'Spring', 8.3),
 ('London', 'United Kingdom', 'Summer', 15.7),
 ('London', 'United Kingdom', 'Fall', 10.4),
 ('Cairo', 'Egypt', 'Winter', 13.6),
 ('Cairo', 'Egypt', 'Spring', 20.7),
 ('Cairo', 'Egypt', 'Summer', 27.7),
 ('Cairo', 'Egypt', 'Fall', 22.2)]

In [35]:
%sql SELECT distinct(City), Country from data_base;

 * sqlite://
Done.

[('Mumbai', 'India'), ('London', 'United Kingdom'), ('Cairo', 'Egypt')]

In [36]:
%%sql SELECT * from data_base
      where Country ='India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346)]

In [37]:
%%sql SELECT * from data_base
      where Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [38]:
%%sql SELECT City, Country, Season, Rainfall from data_base 
where Rainfall > 200 AND Rainfall < 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 346),
 ('London', 'United Kingdom', 'Winter', 207.7),
 ('London', 'United Kingdom', 'Fall', 218.5)]

In [39]:
%%sql select * from data_base where season = 'Fall' and 'Temperature' > 20 
ORDER BY Temperature DESC;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5)]

In [40]:
%%sql
Select City, SUM(rainfall) as Annual_rainfall from data_base
where City = 'Cairo'

 * sqlite://
Done.

[('Cairo', 27.6)]

In [44]:
%%sql Select Season, SUM(rainfall) as Annual_rainfall from data_base
Group By Season;

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

## Question 9

 Suppose list words is defined as follows

words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']  
Write list comprehension expressions that use list words and generate the following
lists

In [83]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']
words_cap = [i.upper() for i in words]
words_low = [i.lower() for i in words]
print(words_cap)
print(words_low)
word_len = [len(word) for word in words]
print(word_len)
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [90]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
Que4 = [[word.upper(), word.lower(), len(word)] for word in words]
print(Que4)

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]